--- a/docs/configuration/combiner.md
+++ b/docs/configuration/combiner.md
@@ -192,54 +183,33 @@ is the batch size and `h` is the hidden dimension, which can be different for ea
-bn_virtual_bs: 128
-sparsity: 0.00001
-dropout: 0
+``` mermaid
+graph LR
+  I1[Encoder Output 1] --> C["Transformer Stack"];
+  IK[...] --> C;
+  IN[Encoder Output N] --> C;
+  C --> R[Reduce];
+  R --> FC[Fully Connected Layers];
+  FC --> ...;
+  subgraph COMBINER..
+  C
+  R
+  FC
+  end
 ```
 
-## Transformer Combiner
+{ data-search-exclude }
@@ -252,95 +222,56 @@ The output is a `b x h'` tensor where `h'` is the size of the last fully connect
 size, or a `b x n x h'` where `n` is the number of input features and `h'` is the hidden / embedding size if no reduction
 is applied.
 
-```
-+-----------+
-|Input      |
-|Feature 1  +-+
-+-----------+ |
-+-----------+ |  +------------+   +------+   +----------+
-|...        +--->|Transformer +-->|Reduce+-->|Fully     +->
-|           | |  |Stack       |   +------+   |Connected |
-+-----------+ |  +------------+              |Layers    |
-+-----------+ |                              +----------+
-|Input      +-+
-|Feature N  |
-+-----------+
-```
-
-These are the available parameters of a `transformer` combiner:
-
